{"https://www.amazon.com/gp/product/B00CBNIXHQ":{"title":"Acer S241HL bmid 24-Inch Screen LED-Lit Computer Monitor,Black","description":"The Acer S241HL bmid 24\" Widescreen LCD with LED-backlit display combines stylish ultra-thin functionality with amazing 1920 x 1080 resolution, allowing you to enjoy High-Definition entertainment in the comfort of your home. Incredible 100, 000, 000: 1 contrast ratio and rapid 5ms response time highlight the advanced technology, but this display is as well. White LED technology minimizes environmental impact with up to 68% lower power consumption versus regular LCDs, great durability and mercury-free materials. The S241HL bmid LCD also features dual inputs (VGA, DVI \u0026 HDMI) for greater compatibility, a Kensington lock slot to protect your investment, and Energy Star compliance to help you save money and energy."},"https://www.amazon.com/gp/product/B00HUGXOAU":{"title":"CE4031 40-Inch 1080p 60Hz LED TV","description":"Sleek oCOSMO CE4031 brush pattern black 40\" 1080P LED MHL \u0026 Roku Ready HDTV features crystal clear LED display that emits brighter and more robust colors with ultra-fast response time, and 3 HDMI ports for a complete home entertainment experience. Plus, the innovative MHL Port and USB port further expands functionality, allowing users to listen to music and view digital pictures quickly and conveniently. CE4031 is perfect addition to any home décor, especially in the bedroom, living room, guestroom, kitchen where the ultra-slim design and eye-catching brush pattern black finish can complement all modern home décor."},"https://www.amazon.com/gp/product/B00KRMMCFM":{"title":"Mount-It! Full Motion TV Wall Mount With Articulating Arm | Tilt, Swivel, and Rotation Motion Mount | Flat Screen Bracket for 23-55” | VESA Compatible up to 400x400 | 66 lbs Capacity","description":"Mount-It! Ultra Slim full motion articulating TV wall mount offers extreme versatility with a maximum extension of 20\" from the wall. It is suitable for LCD and LED TVs, in sizes ranging from 23\" to 55\". Its swivel arm design is incredibly sturdy. Mount swivels from left to right for viewing from multiple angles. Powder coated steel construction and decorative plates provide a sleek, high-tech look. Free 3-axis bubble level included for convenience. Ideal for corner installations. Includes complete hardware kit and installation instructions.\n\nMount-It! experience and guarantee. Mount-It! is the expert in television and computer monitor mounts. We apply our decade long experience in this field to offer the best features at value prices. All our products are guaranteed for satisfaction. Contact our friendly customer support team for any questions or issues.\n\nFeatures:\nFits most of 23-55 inch TVs\n\nSpecifications:\nCollapses to 2.4 inch low profile, Extends 20 inch from the wall.\nTilt, Swivel, Rotate and Extend/Collapse function\nEasy tilting angle adjustment\nHeavy duty steel construction and high-tech welding technology\nIncludes 3-axis bubble level makes leveling work easy and convenient\nIncludes all necessary mounting hardware\nTV Size Range: 23 to 55 inch (some even up to 60 in depending on VESA bolting pattern and the TV weight)\nMax TV weight: 66 lbs\nMounting Pattern: Up to VESA 400x400. Fits VESA 400X400, 400X200, 300X300, 200X200, 200X100, 100X100, 75x75, 50x50 mm.\nMounting Holes: up to 16 inch apart horizontally and up to 16 inch vertically\nWall plate dimensions: 2.9 W by 8.1 H inches.\nTilt: up to 15 degrees down or up and any angle in between. Swivel: 180 degrees to left or to right\nExtension from the wall: Between 2.4 to 20 inches."},"https://www.amazon.com/gp/product/B00SMBESTI":{"title":"VIZIO E40-C2 E Series 40-Inch Class Full-Array LED Smart TV","description":"The all-new 2015 E-Series 40\" (40\" diag.) Full-Array LED Smart TV has arrived. Featuring a new, modern design, brilliant picture quality, and faster, easier-to-use smart TV experience, the all-new E-Series brings you premium HD entertainment at an incredible value. Built-in high-speed Wi-Fi gets you connected in a snap, and with the hottest apps to choose from like Netflix, Amazon Instant Video, iHeartRadio, Hulu Plus, Spotify, YouTube and more1. Enjoying what you want, when you want it is easier than ever before. Plus, you get brilliant picture quality using the latest advanced technologies - like Full-Array LED backlighting for superior light uniformity, and up to 5 Active LED Zones producing vivid details with deeper, more pure black levels2. For sports and action fans, E-Series includes Clear Action 240, which combines powerful image processing with 120Hz effective refresh rate for enhanced detail in fast action scenes. VIZIO E-Series: Incredible picture, unbeatable value. 1High-speed/Broadband Internet service, app subscription and access equipment are required and not provided by VIZIO. 2Compared to previous generations of VIZIO E-Series TVs."},"https://www.amazon.com/gp/product/B00SMBFZNG":{"title":"VIZIO Sound Bar for TV, 29” Surround Sound System for TV, Home Audio Sound Bar, 2.0 Channel Home Theater with Bluetooth – SB2920-C6","description":"The all-new VIZIO 29\" 2.0 Sound Bar offers amazing audio in a compact size. Its sophisticated new design makes it an attractive addition to any 32\"+ class TV. Use Bluetooth to stream music from your smartphone, tablet or computer. With everything you need for a quick and easy setup, upgrading to an amazing home theater experience has never been easier - plug the Sound Bar in, connect it to your TV, sit back and enjoy. The 2.0 Sound Bar features two powerful full-range stereo speakers that boost your audio and deliver amazing sound. Streamlined Design VIZIO Sound Bars are crafted to accentuate your TV with a minimalist body style that blends in with any room of your home. VIZIO Sound Bars utilize DTS audio technologies to deliver elevated multi-channel audio for the most immersive sound quality."},"https://www.amazon.com/gp/product/B00TRQPVKM":{"title":"LG Electronics 42LF5600 42-Inch 1080p LED TV (2015 Model)","description":"Full HD TV"},"https://www.amazon.com/gp/product/B00TSUGXKE":{"title":"Fire Tablet with Alexa, 7\" Display, 8 GB, Black - with Special Offers (Previous Generation - 5th)","description":""},"https://www.amazon.com/gp/product/B00VVOCQHE":{"title":"TCL 32D2700 32-Inch 720p LED TV (2015 Model)","description":"Enjoy The Creative Life with the TCL 32\" 720p direct LED HDTV. It delivers premium picture quality and tremendous value in a sophisticated slim frame design perfect for bringing entertainment to any space. This flat screen LED HDTV features High Definition 720p resolution for a sharper image and TCL True Color Technology for brilliant color and contrast. With direct LED backlighting, view darker blacks and luminous brightness while maintaining the best standards in energy efficiency."},"https://www.amazon.com/gp/product/B00VVOCSOU":{"title":"TCL 40FD2700 40-Inch 1080p LED TV (2015 Model)","description":"Enjoy The Creative Life with the TCL 40\" 1080p direct LED HDTV. It delivers premium picture quality and tremendous value in a sophisticated slim frame design perfect for bringing entertainment to any space. This flat screen LED HDTV features High Definition 1080p resolution for a sharper image and TCL True Color Technology for brilliant color and contrast. With direct LED backlighting, view darker blacks and luminous brightness while maintaining the best standards in energy efficiency."}}